{
  "backend/main.mo": "Actor canister managing content blocks, staff, notices, gallery items, contact submissions, and user profiles with access‑controlled CRUD and upgrade persistence.",
  "feature_evidence.json": "Defines feature evidence linking features to files, components, and tests for the school website project.",
  "frontend-file-summaries.txt": "Contains short summaries for two frontend notice‑related pages and admin sections.",
  "frontend/index.css": "Tailwind CSS base with custom theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/admin/AdminDashboard.tsx": "Admin dashboard rendering tabbed sections for managing content, staff, notices, gallery, and inquiries with logout support.",
  "frontend/src/admin/sections/ContentBlocksSection.tsx": "Admin UI for listing, creating, editing, and deleting content blocks using dialogs, tables, and mutation hooks.",
  "frontend/src/admin/sections/GallerySection.tsx": "Admin UI for listing, creating, editing, and deleting gallery items using dialog forms and mutations.",
  "frontend/src/admin/sections/InquiriesSection.tsx": "Displays contact form submissions with view and delete dialogs, including date formatting.",
  "frontend/src/admin/sections/NoticesSection.tsx": "Admin interface to manage notices with add, edit, delete dialogs and date handling.",
  "frontend/src/admin/sections/StaffSection.tsx": "Provides CRUD management for staff members via dialogs and form inputs.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all public pages and the admin page inside a shared SiteLayout.",
  "frontend/src/components/ContentBlock.tsx": "Simple card component rendering a title and text content.",
  "frontend/src/components/PublicNav.tsx": "Responsive public navigation bar with active link highlighting and mobile drawer.",
  "frontend/src/components/SiteLayout.tsx": "Page layout with header, navigation, footer, and branding for the public site.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminContent.ts": "Provides React Query hooks for admin CRUD operations on content blocks, staff, notices, gallery items, and contact submissions via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for managing login, stored identities, and auth-client lifecycle.",
  "frontend/src/hooks/usePublicContent.ts": "Provides read-only public content hooks for fetching content blocks, staff, notices, gallery items, and submitting contact forms.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with a government-style color palette.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and loads the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page by loading three content blocks with skeleton fallbacks and default text.",
  "frontend/src/pages/AcademicsPage.tsx": "Renders the Academics page using three content blocks with loading states and predefined fallback content.",
  "frontend/src/pages/AdminPage.tsx": "Admin page handling password-based unlock, Internet Identity login, and admin check before rendering the admin dashboard.",
  "frontend/src/pages/AdmissionsPage.tsx": "Displays admissions process, requirements, and dates using dynamic content blocks with skeleton fallbacks.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with a form submission flow and optional dynamic contact info content block.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery grid from fetched gallery items with loading placeholders and image fallback handling.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero content, quick links, and dynamic welcome and mission content blocks.",
  "frontend/src/pages/NoticeDetailPage.tsx": "Shows details for a single notice including date, title, and body, with loading and not-found states.",
  "frontend/src/pages/NoticesListPage.tsx": "Displays a list of notices fetched from the API with loading skeletons and links to detail pages.",
  "frontend/src/pages/StaffPage.tsx": "Fetches and renders staff profiles in a grid with avatars, bios, and loading placeholders.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Metadata describing project state, features, requirements, and image needs for a school website."
}