{
  "kind": "build_request",
  "title": "Government school website with public pages and password-protected admin panel",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create the public-facing government school website with a complete navigation and pages/sections: Home, About the School, Admissions, Academics, Staff/Faculty, News & Notices, Gallery, and Contact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create a government school website with all future and with admin panel url on password 🔑"
        ]
      },
      "acceptanceCriteria": [
        "Top-level navigation links to all required pages/sections",
        "Each page renders meaningful placeholder content in English that can later be managed via the admin panel",
        "Site layout is responsive for mobile/tablet/desktop"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a consistent visual theme for the site (colors, typography, spacing, and component styling) suitable for an official government school identity, and apply it across all pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Theme is applied consistently across public pages and admin pages",
        "Avoid blue/purple as primary colors (use a different coherent palette)",
        "Typography and spacing feel formal/official and readable"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement backend content models and canister APIs to store and retrieve all website content needed for the public pages (school profile text, admissions info, academics info, staff list, notices/news posts, gallery items, contact details).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "government school website with all future"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes query methods for public content reads",
        "Backend exposes update methods for admin-only content writes",
        "Data persists across canister upgrades using stable storage (no migration file required for initial build)"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Build a password-protected admin panel that allows authorized admins to manage site content (create/edit/delete staff entries, notices/news posts, gallery items, and edit page content blocks and contact details).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "with admin panel url on password 🔑"
        ]
      },
      "acceptanceCriteria": [
        "Admin UI includes login form requiring a password",
        "After login, admin can perform CRUD actions for required content types and changes appear on public pages",
        "All admin write operations are rejected by the backend unless authenticated"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Protect access to the admin panel and its URL by requiring a password before showing admin content; unauthenticated users must not be able to view admin dashboard screens or perform admin operations.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "admin panel url on password"
        ]
      },
      "acceptanceCriteria": [
        "Visiting the admin route while unauthenticated shows only a password prompt (no admin data rendered)",
        "Admin API calls require an authenticated session/token and fail without it",
        "Provide a logout action that clears the local session and returns to the password prompt"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add an admin settings capability to change the admin password (requiring the current password), with the password stored securely in the backend (hashed, not plaintext).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores only a password hash (no plaintext password)",
        "Admin can update the password only after providing the current password",
        "After password change, old password no longer grants access"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add a Contact page form that lets visitors submit inquiries to the school; store submissions in the backend and allow admins to view and delete them in the admin panel.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Public contact form validates required fields and submits to the backend",
        "Admin panel lists submitted inquiries with timestamp and message details",
        "Admin can delete inquiries and they no longer appear in the list"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add gallery support where public users can view a gallery grid and admins can add/remove gallery entries, including support for linking to image assets stored as frontend static files.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Public Gallery page shows a grid/list of gallery items",
        "Admin can add/edit/remove gallery entries (title/description and image reference)",
        "Gallery entries persist and render correctly after refresh"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add a News & Notices system where admins can publish notices (title, body, date) and the public site shows a list view and detail view.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Public notices list is sorted with newest first",
        "Each notice has a dedicated detail view",
        "Admin can create/edit/delete notices and changes reflect on the public site"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Generate and include required static images in the frontend (placed in frontend/public/assets/generated) and use them in the site (header/footer/hero as appropriate) without routing image delivery through the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "All required generated images exist under frontend/public/assets/generated with the exact filenames specified",
        "Public pages render using the generated images via static paths",
        "No backend endpoints are used to serve these images"
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all backend logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or other immutable paths listed by the system.",
    "Use Internet Computer canister storage only (no external databases or third-party auth providers)."
  ],
  "nonGoals": [
    "Implementing third-party login (Google/Facebook/GitHub/Auth0).",
    "Real-time chat, push notifications, or email/SMS sending integrations.",
    "Uploading user images directly to the backend (gallery uses static frontend assets or URLs)."
  ],
  "imageRequirements": {
    "required": [
      "Government school emblem/crest style logo, flat vector look (school-logo.dim_512x512.png)",
      "Wide hero banner illustration of a government school campus building with students, clean minimal style (hero-campus.dim_1600x600.png)",
      "Set of simple outline icons for: admissions, academics, staff, notices, gallery, contact (school-icons.dim_512x512.png)"
    ],
    "edits": []
  }
}